app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "toto@gmail.com"], ["password_digest", "$2a$10$VAmb..pqIbAS6OsQJpbGd.mv7domp2xkTZYVL7tff7tEMOuORPqfm"]]

  def update
    @user = User.find(params[:id])

    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["email", "willywill@gmail.com"], ["password_digest", "$2a$10$hdL3gbAUm.ky0PsDfSkPmutEqwUKWYVIHrPm9cIMUibl211aLtr5K"], ["id", 1]]

  def destroy
    @user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]